/********************************************************************************************************************
 * 루트 App 컴포넌트
 * - src/index.ts 에서 사용
 * - Android : NavigationBar 의 높이를 계산한 후 AppEasUpdate 컴포넌트 표시
 * - iOS : AppEasUpdate 컴포넌트 바로 표시
 * ******************************************************************************************************************/

import app from '@app';
import {AppInitializer} from './layout';

interface Props {
  notificationData?: Dict<string | object | number>;
}

const AppContainer = ({notificationData}: Props) => {
  /********************************************************************************************************************
   * State
   * ******************************************************************************************************************/

  const [initialized, setInitialized] = useState(false);

  /********************************************************************************************************************
   * Changed
   * ******************************************************************************************************************/

  /** 푸시 알림 데이터 설정 */
  useChanged(() => {
    app.notification.setInitData(notificationData);
    setInitialized(true);
  }, [notificationData]);

  /********************************************************************************************************************
   * Render
   * ******************************************************************************************************************/

  return initialized ? <AppInitializer /> : null;
};

export default AppContainer;
